[{"BOOKMARK":false,"CATEGORIES":"Asian","INGREDIENTS":["1/4_cup_gochujang_(Korean_hot_pepper_paste)","1_bunch_fresh_spinach__cut_into_thin_strips","1_tablespoon_soy_sauce","1_teaspoon_olive_oil","2_carrots__cut_into_matchsticks","1_clove_garlic__minced","1_pinch_red_pepper_flakes","1_pound_thinly-sliced_beef_top_round_steak","1_teaspoon_olive_oil","4_large_eggs4_cups_cooked_white_rice","4_teaspoons_toasted_sesame_oil__divided","1_teaspoon_sesame_seeds","2_teaspoons_gochujang_(Korean_hot_pepper_paste)__divided_(optional)"],"IMG_URL":"http://www.kongsim.co.kr/upload/menu_01/2017_02_22/hero_ljtdP_2017_02_22_15_50_30.jpg","CAPTION":"Bi-bim-bap","_locals":{},"DIRECTIONS":["1. Stir cucumber pieces with 1/4 cup gochujang paste in a bowl; set aside.","2. Bring about 2 cups of water to a boil in a large nonstick skillet and stir in spinach; cook until spinach is bright green and wilted, 2 to 3 minutes. Drain spinach and squeeze out as much moisture as possible; set spinach aside in a bowl and stir soy sauce into spinach.","3. Heat 1 teaspoon olive oil in large nonstick skillet and cook and stir carrots until softened, about 3 minutes; stir in garlic and cook just until fragrant, about 1 more minute. Stir in cucumber pieces with gochujang paste; sprinkle with red pepper flakes, and set the mixture aside in a bowl.","4. Brown beef in a clean nonstick skillet over medium heat, about 5 minutes per side, and set aside. In a separate nonstick skillet, heat 1 more teaspoon olive oil over medium-low heat and fry the eggs just on one side until yolks are runny but whites are firm, 2 to 4 minutes each.","5. To assemble the dish, divide cooked rice into 4 large serving bowls; top with spinach mixture, a few pieces of beef, and cucumber mixture. Place 1 egg atop each serving. Drizzle each bowl with 1 teaspoon of sesame oil, a sprinkle of sesame seeds, and a small amount of gochujang paste if desired."]},{"BOOKMARK":false,"CATEGORIES":"Mexican","INGREDIENTS":[" ½_pounds_skinless__boneless_chicken_breast_meat_-_cubed","⅛_cup_red_wine_vinegar","½_lime__juiced","1_teaspoon_white_sugar","½_teaspoon_salt","½_teaspoon_ground_black_pepper","2_green_onions__chopped","2_cloves_garlic__minced","1_teaspoon_dried_oregano","10_(6_inch)_flour_tortillas","1_tomato__diced","¼_cup_shredded_lettuce","¼_cup_shredded_Monterey_Jack_cheese","¼_cup_salsa"],"IMG_URL":"https://www.jessicagavin.com/wp-content/uploads/2016/09/two-mahi-mahi-fish-taco-plate-with-avocado-lime-sauce-1200.jpg","CAPTION":"Lime Chicken Soft Tacos","_locals":{},"DIRECTIONS":["1. Saute chicken in a medium saucepan over medium high heat for about 20 minutes. Add vinegar, lime juice, sugar, salt, pepper, green onion, garlic and oregano. Simmer for an extra 10 minutes.","2. Heat an iron skillet over medium heat. Place a tortilla in the pan, warm, and turn over to heat the other side. Repeat with remaining tortillas. Serve lime chicken mixture in warm tortillas topped with tomato, lettuce, cheese and salsa."]},{"BOOKMARK":false,"CATEGORIES":"American","INGREDIENTS":["1_(12_ounce)_sirloin_steak","salt_and_freshly_ground_black_pepper_to_taste","2_tablespoons_oil__or_as_needed","1/3_cup_shiitake_mushrooms__stems_discarded__caps_thickly_sliced","1/2_shallot__sliced","1_clove_garlic__peeled","1/3_cup_dry_white_wine","1/3_cup_beef_broth","1/4_cup_butter__cubed","2_tablespoons_chopped_fresh_tarragon_"],"IMG_URL":"https://lh3.googleusercontent.com/proxy/WGmd0nX27AApPEXhO7IAoM35HXDeyrjoG6F8FCvEQ0FHx_wL0kpofvxBlRvtFs6UztSy_0yResigcdiCIR9H2FvbV_AUvKZWR6FIkNxWHnSWOWLZBHez-ZoX0lcCXDut0F0B8y7iF8m3IXhRpJewe8pZbX4Wh3TM5iWtOHxXxus-xXrFcg=s0-d","CAPTION":"Sirloin Steak with Mushrooms Pasta","_locals":{},"DIRECTIONS":["1. Season steak with salt and pepper on both sides.","2. Heat a heavy skillet over high heat until a drop of water immediately sizzles and evaporates when flicked onto the skillet's surface. Pour in oil. Add steak and cook until it is beginning to firm and is hot and slightly pink in the center, about 4 minutes per side. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).","3. Remove steak from skillet and set aside. Tent with foil to keep warm. Discard oil remaining in the skillet.","4. Reduce heat to medium-low and cook mushrooms, shallot, and garlic, stirring frequently, until softened, about 5 minutes. Pour in white wine and cook until slightly reduced. Pour in beef broth. Reduce heat to low and stir in butter, 1 cube at a time, stirring well after each addition. Stir in tarragon. Season with salt and pepper. Serve mushroom sauce over the steak."]},{"BOOKMARK":false,"CATEGORIES":"Italian","INGREDIENTS":["1_pound_bucatini_pasta","1_(2_ounce)_can_anchovy_fillets__oil_reserved","1_teaspoon_red_pepper_flakes__or_to_taste","3_cloves_garlic__minced","2_zucchini__halved_lengthwise_and_cut_in_1/4_inch_slices","1_pint_grape_tomatoes","2_teaspoons_dried_oregano","2_teaspoons_dried_basil","1_pound_peeled_and_deveined_medium_shrimp"],"IMG_URL":"https://images.media-allrecipes.com/userphotos/600x600/6556979.jpg","CAPTION":"Shrimp Pasta","_locals":{},"DIRECTIONS":["1. Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.","2. Meanwhile, stir together the anchovies and their oil with the red pepper flakes and garlic in a large skillet over medium heat, breaking up the anchovies as you stir. Once the garlic begins to sizzle, add the sliced zucchini, and cook until it begins to soften, about 3 minutes. Stir in the grape tomatoes, and continue cooking until the zucchini is tender, and the skins of the tomatoes begin to pop, 5 minutes more.","3. Sprinkle the vegetable mixture with oregano and basil, then stir in shrimp. Cook until the shrimp turn pink and are no longer translucent. Pour over bucatini to serve."]},{"BOOKMARK":false,"CATEGORIES":"American","INGREDIENTS":["1/4_cup_maple_syrup","2_tablespoons_soy_sauce","1_clove_garlic__minced","1/4_teaspoon_garlic_salt","1/8_teaspoon_ground_black_pepper","1_pound_salmon"],"IMG_URL":"https://vignette.wikia.nocookie.net/recipes/images/7/7c/Maplesalmon.jpg/revision/latest?cb=20131218002632","CAPTION":"Maple Salmon","_locals":{},"DIRECTIONS":["1. In a small bowl, mix the maple syrup, soy sauce, garlic, garlic salt, and pepper.","2. Place salmon in a shallow glass baking dish, and coat with the maple syrup mixture. Cover the dish, and marinate salmon in the refrigerator 30 minutes, turning once.","3. Preheat oven to 400 degrees F (200 degrees C).","4. Place the baking dish in the preheated oven, and bake salmon uncovered 20 minutes, or until easily flaked with a fork."]},{"BOOKMARK":false,"CATEGORIES":"Italian","INGREDIENTS":["1_lime","3_cloves_garlic__minced","1_pound_large_fresh_shrimp__peeled_and_deveined","3/4_cup_chicken_broth_or_chicken_stock","1_medium_orange_bell_pepper_or_red_bell_pepper__cut_into_2-inch_long_strips","1_small_onion__cut_in_half_and_sliced","1/4_cup_chopped_fresh_cilantro_leaves","4_cups_romaine_lettuce_or_iceberg_lettuce__torn_into_bite-sized_pieces","2_large_tomatoes__thickly_sliced","1/4_teaspoon_ground_black_pepper"],"IMG_URL":"https://img1.coastalliving.timeinc.net/sites/default/files/image/2009/08/shrimp-salad-cl-1611640-x.jpg","CAPTION":"Margarita Shrimp Salad","_locals":{},"DIRECTIONS":["1. Grate 2 teaspoons zest and squeeze 1 tablespoon juice from the lime.","2. Stir the lime juice, lime zest, and garlic in a 2-quart shallow, nonmetallic baking dish or a gallon-size resealable plastic bag. Add the shrimp and toss to coat. Cover the dish or seal the bag and refrigerate for 30 minutes, turning the shrimp over several times during the marinating time.","3. Heat the broth in a 2-quart saucepan over medium-high heat to a boil. Add the pepper and onion and cook until the vegetables are tender-crisp, stirring occasionally.","4. Reduce the heat to medium. Add the shrimp and marinade to the saucepan and heat to a boil. Cook until the shrimp are cooked through. Stir in the cilantro.","5. Divide the lettuce, tomatoes and shrimp mixture among 4 serving plates. Season with the black pepper."]},{"BOOKMARK":false,"CATEGORIES":"American","INGREDIENTS":["1/2_cup_butter","2/3_cup_white_sugar","2_eggs","1_cup_buttermilk","1/2_teaspoon_baking_soda","1_cup_cornmeal","1_cup_all-purpose_flour","1/2_teaspoon_salt"],"IMG_URL":"https://www.tasteofhome.com/wp-content/uploads/2018/01/exps29167__TH163622B04_20_1b-696x696.jpg ","CAPTION":"Grandmother's Buttermilk Cornbread","_locals":{},"DIRECTIONS":["1. Preheat oven to 375 degrees F (175 degrees C). Grease an 8 inch square pan.","2. Melt butter in large skillet. Remove from heat and stir in sugar. Quickly add eggs and beat until well blended. Combine buttermilk with baking soda and stir into mixture in pan. Stir in cornmeal, flour, and salt until well blended and few lumps remain. Pour batter into the prepared pan.","3. Bake in the preheated oven for 30 to 40 minutes, or until a toothpick inserted in the center comes out clean."]}]